---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodGrowthPerlinProf
source: html/7cfb7d28-42d9-bfec-b17a-48e67d51fb0b.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodGrowthPerlinProf Property

The property labeled "Profile for growth perlin noise" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodGrowthPerlinProf { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".